# Pandas

## 1. Pandas Series 
A pandas series is a one-dimensional array like object that can hold many data types, such as numbers or strings, and has an option to provide axis labels.

### Example 1- Create a Series

In [1]:
# First import Pandas library as pd into Python
import pandas as pd

# Create a Pandas series that stores a grocery list 

groceries = pd.Series(data = [30, 6, 'Yes', 'No'], index = ['eggs', 'apples', 'milk', 'bread'])

# Display the grocerires lists
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

We see that Pandas Series are displayed with the indices in the first column and the data in the second column. Notice that the data is not indexed 0 to 3 but rather it is indexed with the names of the food we put in, namely eggs, apples, etc... Also, notice that the data in our Pandas Series has both integers and strings.

### Example 2 - Print attributes - Shape, ndim,  size, values and index

In [2]:
# Print some information about Groceries 
print('Groceries has shape:', groceries.shape)
print('Groceries has dimension:', groceries.ndim)
print('Groceries has a total of {} elements.'.format(groceries.size))

print('The data in Groceries is:', groceries.values)
print('The index of Groceries is:', groceries.index)

Groceries has shape: (4,)
Groceries has dimension: 1
Groceries has a total of 4 elements.
The data in Groceries is: [30 6 'Yes' 'No']
The index of Groceries is: Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

### Example 3 - Check if an index is available in the given Series

In [3]:
# check whether bananas and breads  are a food item (an index) in Groceries 

x = 'bananas' in groceries 

y = 'bread' in groceries

print('Is bananas an index label in Groceries:', x )
print('Is bread an index label in Groceries:', y )

Is bananas an index label in Groceries: False
Is bread an index label in Groceries: True

### I. Accessing and Deleting Elements in Pandas Series

#### Example 1: Access elements using index labels

In [4]:
# We access elements in Groceries using index labels:

# We use a single index label
print('How many eggs do we need to buy:',groceries['eggs'] )
print()

# we can access multiple index labels
print('Do we need milk and bread:\n', groceries[['milk', 'bread']]) 
print()

# we use loc to access multiple index labels
print('How many eggs and apples do we need to buy:\n', groceries.loc[['eggs', 'apples']]) 
print()

# We access elements in Groceries using numerical indices:

# we use multiple numerical indices
print('How many eggs and apples do we need to buy:\n', groceries.iloc[[0, 1]] ) 
print()

# We use a negative numerical index
print('Do we need bread:\n', groceries[-1] ) 
print()

# We use a single numerical index
print('How many eggs do we need to buy:', groceries.iloc[0] ) 
print()
# we use iloc to access multiple numerical indices
print('Do we need milk and bread:\n', groceries.iloc[[2, 3]])

How many eggs do we need to buy: 30

Do we need milk and bread:
 milk     Yes
bread     No
dtype: object

How many eggs and apples do we need to buy:
 eggs      30
apples     6
dtype: object

How many eggs and apples do we need to buy:
 eggs      30
apples     6
dtype: object

Do we need bread:
 No

How many eggs do we need to buy: 30

Do we need milk and bread:
 milk     Yes
bread     No
dtype: object

#### Example 2. Mutate elements using index labels

In [5]:
# We display the original grocery list
print('Original Grocery List:\n', groceries)

# We change the number of eggs to 2
groceries['eggs'] = 2

# We display the changed grocery list
print()
print('Modified Grocery List:\n', groceries)

Original Grocery List:
 eggs       30
apples      6
milk      Yes
bread      No
dtype: object

Modified Grocery List:
 eggs        2
apples      6
milk      Yes
bread      No
dtype: object

#### Example 3: Delete elements out-of-place using `drop()`

In [6]:
# We display the original grocery list
print('Original Grocery List:\n', groceries)

# We remove apples from our grocery list. The drop function removes elements out of place
print()
print('We remove apples (out of place):\n', groceries.drop('apples'))

# When we remove elements out of place the original Series remains intact. To see this
# we display our grocery list again
print()
print('Grocery List after removing apples out of place:\n', groceries)

Original Grocery List:
 eggs        2
apples      6
milk      Yes
bread      No
dtype: object

We remove apples (out of place):
 eggs       2
milk     Yes
bread     No
dtype: object

Grocery List after removing apples out of place:
 eggs        2
apples      6
milk      Yes
bread      No
dtype: object

#### Example 4: Delete elements in-place using `drop()`

In [7]:
# We display the original grocery list
print('Original Grocery List:\n', groceries)

# We remove apples from our grocery list in place by setting the inplace keyword to True
groceries.drop('apples', inplace = True)

# When we remove elements in place the original Series its modified. To see this
# we display our grocery list again
print()
print('Grocery List after removing apples in place:\n', groceries)

Original Grocery List:
 eggs        2
apples      6
milk      Yes
bread      No
dtype: object

Grocery List after removing apples in place:
 eggs       2
milk     Yes
bread     No
dtype: object

## II. Arithmetic Operations on Pandas Series

In [8]:
#  let's create a Pandas Series that stores a grocery list of just fruits 

fruits = pd.Series(data = [10, 6, 3], index = ['apples', 'oranges', 'bananas'])

# Display the information
fruits

apples     10
oranges     6
bananas     3
dtype: int64

#### Example 1: Element-wise basic arithmetic operations

In [9]:
# add 2 to each item in fruits
print('fruits + 2:\n', fruits + 2)
# subtract 2 to each item in fruits 
print('fruit - 2:\n', fruits - 2)
# Multiply each item in fruits by 2
print('fruits * 2:\n', fruits * 2)
# Divide each item in fruits by 2
print('fruits /2 : \n', fruits / 2)

fruits + 2:
 apples     12
oranges     8
bananas     5
dtype: int64
fruit - 2:
 apples     8
oranges    4
bananas    1
dtype: int64
fruits * 2:
 apples     20
oranges    12
bananas     6
dtype: int64
fruits /2 :
 apples     5.0
oranges    3.0
bananas    1.5
dtype: float64

#### Example 2: Use mathematical fucntions from NumPy to operate on Series

In [10]:
# first import numpy to be able to use the mathematical functions
import numpy as np

# Original list of fruits 
print('Original grocery list of fruits:\n', fruits)

# Apply different mathematical funtions to all elements of fruits 

print('EXP(x) = \n', np.exp(fruits))

print('SQRT(x) = \n', np.sqrt(fruits))

print('POW(x,2) = \n', np.power(fruits,2))

Original grocery list of fruits:
 apples     10
oranges     6
bananas     3
dtype: int64
EXP(x) =
 apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64
SQRT(x) =
 apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64
POW(x,2) =
 apples     100
oranges     36
bananas      9
dtype: int64

#### Example 3: Perform arithmetic operations on selected elements

In [11]:
#### Print fruits for reference
print('Original grocery list of fruits: \n', fruits)

# Add 2 only to bananas
print('Amount of banana + 2 = ', fruits['bananas'] + 2)

# Subtract 2 from apples
print(' Amount of apples -2 = ', fruits.iloc[0] - 2)

# We multiply apples and oranges by 2
print('We double the amount of apples and oranges:\n', fruits[['apples', 'oranges']] * 2)
print()
# We divide apples and oranges by 2
print('We half the amount of apples and oranges:\n', fruits.loc[['apples', 'oranges']] / 2)

Original grocery list of fruits:
 apples     10
oranges     6
bananas     3
dtype: int64
Amount of banana + 2 =  5
 Amount of apples -2 =  8
We double the amount of apples and oranges:
 apples     20
oranges    12
dtype: int64

We half the amount of apples and oranges:
 apples     5.0
oranges    3.0
dtype: float64

In [12]:
#### Example 4: Perform multiplication on a Series having integer and strings elements 

groceries * 2

eggs          4
milk     YesYes
bread      NoNo
dtype: object

## III. Create Pandas DataFrame

#### Create a DataFrame manually 
We will start by creating a DataFrame manually from a dictionary of Pandas Series. It is a two-step process:

1. The first step is to create the dictionary of Pandas Series.
2. After the dictionary is created we can then pass the dictionary to the `pd.DataFrame()`function.

In [13]:
# Import Pandas libray into Python 
import pandas as pd

# Create a dictionary of Pandas Series

items = {'Bob': pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']), 'Alice': pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}

print(type(items))

<class 'dict'>

#### Example 1: Create a DataFrame using a dictionary of Series

In [14]:
# Create a Pandas DataFrame by passing it a dictionary of Pandas Series 
shopping_carts = pd.DataFrame(items)

# Display th DataFrame
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

#### Example 2: DataFrame assigns the numerical row indexes by default

In [15]:
# Create a dictionary of pandas without indexes 
data = {'Bob': pd.Series(data = [245, 25, 55]), 'Alice': pd.Series(data = [40, 110, 500, 45])}

# Create a DataFrame from the dictionary 
df = pd.DataFrame(data)
# Display the DataFrame
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

#### Example 3: Demonstrate a few attributes of DataFrame

In [16]:
# Print some infomation about the shopping_carts that you have created previously
print('shopping_carts has shape:', shopping_carts.shape)
print('shopping_carts has dimension:', shopping_carts.ndim)
print('shopping_carts has a total of {} elements.'.format(shopping_carts.size))
print('The data in shopping_carts is:\n', shopping_carts.values)
print()
print('The row index in shopping_carts is:', shopping_carts.index)
print()
print('The column index in shopping_carts is:', shopping_carts.columns)

shopping_carts has shape: (5, 2)
shopping_carts has dimension: 2
shopping_carts has a total of 10 elements.
The data in shopping_carts is:
 [[245. 500.]
 [ nan  40.]
 [ nan 110.]
 [ 25.  45.]
 [ 55.  nan]]

The row index in shopping_carts is: Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

The column index in shopping_carts is: Index(['Bob', 'Alice'], dtype='object')

#### Example 4: Selecting specific rows and columns of a DataFrame

In [17]:
# Create a DataFrame that only has 'Bob' Column data
bob_shopping_cart = pd.DataFrame(items, columns = ['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [18]:
# Create another Dataframe that only has selected items for both Alice and Bob
sel_shopping_cart = pd.DataFrame(items, index = ['pants', 'book'])

sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [19]:
# We Create a DataFrame that only has selected items for Alice
alice_sel_shopping_cart = pd.DataFrame(items, index = ['glasses', 'bike'], columns = ['Alice'])

# We display alice_sel_shopping_cart
alice_sel_shopping_cart

         Alice
glasses    110
bike       500

#### Example 5: Create a DataFrame using a dictionary of lists

In [20]:
# Create a dictionary of lists (arrays)

data = {'Integers': [1, 2, 3], 
         'Floats': [4.5, 8.2, 9.6]}
df2 = pd.DataFrame(data)
df2

   Integers  Floats
0         1     4.5
1         2     8.2
2         3     9.6

#### Example 6: Create a DataFrame using a dictionary of lists, and custom row-indexes(labels)

In [21]:
#### Create a DataFrame using a dictionary of lists, and custom row-indexes(labels)

data = {'Integers': [1, 2, 3], 'Floats': [4.5, 8.2, 9.6]}

# Create a DataFrame and provide the row index

df = pd.DataFrame(data, index = ['label 1', 'label 2', 'label 3'])

# we display the DataFrame

df

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

#### Example 9: Create a DataFrame using a list of dictionaries

In [22]:
# Create a lists of Python dictionaries

items = [{'bike':20, 'pants': 30, 'watches': 35}, {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# Create a DataFrame from list dictionary items
df3 = pd.DataFrame(items)

df3

   bike  pants  watches  glasses  bikes
0  20.0     30       35      NaN    NaN
1   NaN      5       10     50.0   15.0

#### Example 10: Create a DataFrame using a of list of dictionaries, and custom row-indexes (labels)

In [23]:
# Create a lists of Python dictionaries

items2 = [{'bikes':20, 'pants': 30, 'watches': 35}, {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# Create a DataFrame from list dictionary items and provide the raw index
df4 = pd.DataFrame(items2, index = ['store 1', 'store 2'])

df4

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

## IV Accessing Elements in Pandas DataFrames

### Example 1: Access elements using labels

In [24]:
# Create store items DataFrame
store_items = df4

# Access rows, columns and elements using labels

print('How many bikes are in each store:\n', store_items[['bikes']])
print()
print('How many bikes and pants are in each store:\n',store_items[['bikes', 'pants']] )
print()
print('What items are in Store 1:\n',store_items.loc[['store 1']] )
print()
print('How many bikes are in Store 2:', store_items['bikes']['store 2'])

How many bikes are in each store:
          bikes
store 1     20
store 2     15

How many bikes and pants are in each store:
          bikes  pants
store 1     20     30
store 2     15      5

What items are in Store 1:
          bikes  pants  watches  glasses
store 1     20     30       35      NaN

How many bikes are in Store 2: 15

t is important to know that when accessing individual elements in a DataFrame, as we did in the last example above, the labels should always be provided with the column label first, i.e. in the form `dataframe[column][row]`

#### Example 2. Add a column to an existing DataFrame

In [25]:
# We add a new column named shirts to our store_items DataFrame indicating the number of
# shirts in stock at each store. We will put 15 shirts in store 1 and 2 shirts in store 2
store_items['shirts'] = [15, 1]

# We display the modified DataFrame
store_items

         bikes  pants  watches  glasses  shirts
store 1     20     30       35      NaN      15
store 2     15      5       10     50.0       1

#### Example 3. Add a new column based on the arithmetic operation between existing columns of a DataFrame

In [26]:
# We make a new column called suits by adding the number of shirts and pants
store_items['suits'] = store_items['shirts'] + store_items['pants']

# We display the modified DataFrame
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN      15     45
store 2     15      5       10     50.0       1      6

#### Example 4 a. Create a row to be added to the DataFrame and append the new raw to the DataFrame

In [27]:
# We create a dictionary from a list of Python dictionaries that will contain the number of different items at the new store
new_items =[{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

# We create new DataFrame with the new_items and provide and index labeled store 3
new_store = pd.DataFrame(new_items, index = ['store 3'])

# We display the items at the new store
new_store

         bikes  pants  watches  glasses
store 3     20     30       35        4

In [28]:
# We append store 3 to our store_items DataFrame
store_items = store_items.append(new_store)

# We display the modified DataFrame
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN    15.0   45.0
store 2     15      5       10     50.0     1.0    6.0
store 3     20     30       35      4.0     NaN    NaN

#### Example 6. Add new column at a specific location and that has data from the existing columns

In [34]:
# We insert a new column with label shoes right before the column with numerical index 4
store_items.insert(4, 'shoes', [8,5,0])

# we display the modified DataFrame
store_items

         bikes  pants  watches  glasses  shoes  shirts  suits
store 1     20     30       35      NaN      8    15.0   45.0
store 2     15      5       10     50.0      5     1.0    6.0
store 3     20     30       35      4.0      0     NaN    NaN

In [35]:
# We add a new column using data from particular rows in the watches column
store_items['new_watches'] = store_items['watches'][1:]
# We display the modified DataFrame
store_items

         bikes  pants  watches  glasses  shoes  shirts  suits  new_watches
store 1     20     30       35      NaN      8    15.0   45.0          NaN
store 2     15      5       10     50.0      5     1.0    6.0         10.0
store 3     20     30       35      4.0      0     NaN    NaN         35.0

#### Example 7. Delete one  and multiple columns from a DataFrame using `pop() and  drop()` method

In [38]:
# we remove the new watches column
store_items.pop('new_watches')

store_items

         bikes  pants  watches  glasses  shoes  shirts  suits
store 1     20     30       35      NaN      8    15.0   45.0
store 2     15      5       10     50.0      5     1.0    6.0
store 3     20     30       35      4.0      0     NaN    NaN

In [41]:
# We remove the watches and shoes columns
store_items = store_items.drop(['watches', 'shoes'], axis = 1)

# we display the modified DataFrame
store_items

         bikes  pants  glasses  shirts  suits
store 1     20     30      NaN    15.0   45.0
store 2     15      5     50.0     1.0    6.0
store 3     20     30      4.0     NaN    NaN

#### Example 8. Delete rows from a DataFrame

In [46]:
# We remove the store 2 and store 1 rows
store_items = store_items.drop(['store 2', 'store 1'], axis = 0)

# we display the modified DataFrame
store_items

         bikes  pants  glasses  shirts  suits
store 3     20     30      4.0     NaN    NaN

#### Example 9. Modify the column label and the row label

In [48]:
# We change the column label bikes to hats
store_items = store_items.rename(columns = {'bikes': 'hats'})

# we display the modified DataFrame
store_items

         hats  pants  glasses  shirts  suits
store 3    20     30      4.0     NaN    NaN

In [50]:
# We change the row label from store 3 to last store
store_items = store_items.rename(index = {'store 3': 'last store'})

# we display the modified DataFrame
store_items

            hats  pants  glasses  shirts  suits
last store    20     30      4.0     NaN    NaN

#### Example 10. Use existing column values as row-index

In [53]:
# We change the row index to be the data in the pants column
store_items = store_items.set_index('pants')

# we display the modified DataFrame
store_items

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN

## V. Dealing with NaN (Not a Number)

#### Example 1: Creating a DataFrame

In [55]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])

# We display the DataFrame
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

#### Example 2 . Count the total NaN values, Return boolean True/False for each elements if it is a NaN and count NaN down the column

In [57]:
# Count the number of NaN values in store_items

x = store_items.isnull().sum().sum()

# print x
print('Number of NaN values in our DataFrame:', x)

Number of NaN values in our DataFrame: 3

In [59]:
# Return boolean True/False for each element if it is a NaN
store_items.isnull()

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1  False  False    False   False  False  False     True
store 2  False  False    False   False  False  False    False
store 3  False  False    False    True  False   True    False

In [61]:
# Count NaN down the column 
store_items.isnull().sum()

bikes      0
pants      0
watches    0
shirts     1
shoes      0
suits      1
glasses    1
dtype: int64

In [63]:
# Count the total non-NaN values
print('Number of non-NaN values in the columns of our DataFrame:\n', store_items.count())

Number of non-NaN values in the columns of our DataFrame:
 bikes      3
pants      3
watches    3
shirts     2
shoes      3
suits      2
glasses    2
dtype: int64

#### Example 3: Eliminating NaN Values: Drop rows having NaN values and Drop columns having NaN values

In [65]:
# Drop any rows with NaN values
store_items.dropna(axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 2     15      5       10     2.0      5    7.0     50.0

In [67]:
# Drop any columns with NaN values
store_items.dropna(axis = 1)

         bikes  pants  watches  shoes
store 1     20     30       35      8
store 2     15      5       10      5
store 3     20     30       35     10

### Example 4: Substituting NaN Values
1. Replace NaN with 0 
2. Forward fill NaN values down (axis = 0) the dataframe
3. Forward fill NaN values across (axis = 1) the dataframe 
4.  Backward fill NaN values down (axis = 0) the dataframe
5. Backward fill NaN values across (axis = 1) the dataframe 
6.  Interpolate (estimate) NaN values down (axis = 0) the dataframe 
7. Interpolate (estimate) NaN values across (axis = 1) the dataframe

In [70]:
# 1. We replace all NaN values with 0
store_items.fillna(0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      0.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     0.0     10    0.0      4.0

In [72]:
# 2. We replace NaN values with the previous value in the column
store_items.fillna(method = 'ffill', axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

In [74]:
# 3. We replace NaN values with the previous value in the row
store_items.fillna(method = 'ffill', axis = 1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    35.0   10.0   10.0      4.0

In [77]:
# 4. We replace NaN values with the next value in the column
store_items.fillna(method = 'backfill', axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0     50.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [79]:
# 5. We replace NaN values with the next value in the row
store_items.fillna(method = 'backfill', axis = 1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0      NaN
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    10.0   10.0    4.0      4.0

In [81]:
# 6. We replace NaN values by using linear interpolation using column values
store_items.interpolate(method = 'linear', axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

In [83]:
# 7. We replace NaN values by using linear interpolation using row values
store_items.interpolate(method = 'linear', axis = 1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    22.5   10.0    7.0      4.0

# VI. Loading Data into a pandas DataFrame

### Example 1: Load the data from a `.csv` file and look at the first few rows of the DataFrame

In [96]:
# Load Google stock data in a DataFrame
Google_stock = pd.read_csv('./goog-1.csv')

# Print some information about the data
print('Google stock is of type', type(Google_stock))
print('Google stock has shape:', Google_stock.shape)

Google stock is of type <class 'pandas.core.frame.DataFrame'>
Google stock has shape: (3313, 7)

In [97]:
# Look the first few rows of the DataFrame
Google_stock

            Date   Open   High    Low  Close  Adj Close    Volume
0     2004-08-19   49.7   51.7   47.7   49.8       49.8  44994500
1     2004-08-20   50.2   54.2   49.9   53.8       53.8  23005800
2     2004-08-23   55.0   56.4   54.2   54.3       54.3  18393200
3     2004-08-24   55.3   55.4   51.5   52.1       52.1  15361800
4     2004-08-25   52.1   53.7   51.6   52.7       52.7   9257400
...          ...    ...    ...    ...    ...        ...       ...
3308  2017-10-09  980.0  985.4  976.1  977.0      977.0    891400
3309  2017-10-10  980.0  981.6  966.1  972.6      972.6    968400
3310  2017-10-11  973.7  990.7  972.2  989.2      989.2   1693300
3311  2017-10-12  987.5  994.1  985.0  987.8      987.8   1262400
3312  2017-10-13  992.0  997.2  989.0  989.7      989.7   1157700

[3313 rows x 7 columns]

In [98]:
# Look at the first 5 rows of the DataFrame
Google_stock.head()

         Date  Open  High   Low  Close  Adj Close    Volume
0  2004-08-19  49.7  51.7  47.7   49.8       49.8  44994500
1  2004-08-20  50.2  54.2  49.9   53.8       53.8  23005800
2  2004-08-23  55.0  56.4  54.2   54.3       54.3  18393200
3  2004-08-24  55.3  55.4  51.5   52.1       52.1  15361800
4  2004-08-25  52.1  53.7  51.6   52.7       52.7   9257400

In [99]:
# Look at the last 10 rows of the DataFrame
Google_stock.tail(10)

            Date   Open   High    Low  Close  Adj Close   Volume
3303  2017-10-02  960.0  962.5  947.8  953.3      953.3  1283400
3304  2017-10-03  954.0  958.0  949.1  957.8      957.8   888300
3305  2017-10-04  957.0  960.4  950.7  951.7      951.7   952400
3306  2017-10-05  955.5  970.9  955.2  970.0      970.0  1213800
3307  2017-10-06  966.7  979.5  963.4  978.9      978.9  1173900
3308  2017-10-09  980.0  985.4  976.1  977.0      977.0   891400
3309  2017-10-10  980.0  981.6  966.1  972.6      972.6   968400
3310  2017-10-11  973.7  990.7  972.2  989.2      989.2  1693300
3311  2017-10-12  987.5  994.1  985.0  987.8      987.8  1262400
3312  2017-10-13  992.0  997.2  989.0  989.7      989.7  1157700

#### Example 2. Check if any column contains a NaN. Returns a boolean for each column label.

In [100]:
Google_stock.isnull().any()

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

#### Example 3. See the sescriptive statistics of the DataFrame

In [101]:
# Get descriptive statistics on our stock data
Google_stock.describe()

         Open    High     Low   Close  Adj Close   Volume
count  3313.0  3313.0  3313.0  3313.0     3313.0  3.3e+03
mean    380.2   383.5   376.5   380.1      380.1  8.0e+06
std     223.8   225.0   222.5   223.9      223.9  8.4e+06
min      49.3    50.5    47.7    49.7       49.7  7.9e+03
25%     226.6   228.4   224.0   226.4      226.4  2.6e+06
50%     293.3   295.4   289.9   293.0      293.0  5.3e+06
75%     536.7   540.0   532.4   536.7      536.7  1.1e+07
max     992.0   997.2   989.0   989.7      989.7  8.3e+07

In [102]:
# Get descriptive statistics on a single column of our DataFrame
Google_stock['Adj Close'].describe()

count    3313.0
mean      380.1
std       223.9
min        49.7
25%       226.4
50%       293.0
75%       536.7
max       989.7
Name: Adj Close, dtype: float64

### Example 4: Statistical operations: `min`, `max` and `mean`

In [103]:
# Print information about our DataFrame
print('Maximum value of each column:\n', Google_stock.max())
print('Minimum Close value:', Google_stock['Close'].min())
print('Average value of each column:\n', Google_stock.mean())

Maximum value of each column:
 Date         2017-10-13
Open              992.0
High              997.2
Low               989.0
Close             989.7
Adj Close         989.7
Volume         82768100
dtype: object
Minimum Close value: 49.681866
Average value of each column:
 Open         3.8e+02
High         3.8e+02
Low          3.8e+02
Close        3.8e+02
Adj Close    3.8e+02
Volume       8.0e+06
dtype: float64

C:\Users\user\AppData\Local\Temp/ipykernel_4984/127565611.py:4: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print('Average value of each column:\n', Google_stock.mean())

### Example 5: Statistical operation - `Correlation `

In [104]:
Google_stock.corr()

           Open  High  Low  Close  Adj Close  Volume
Open        1.0   1.0  1.0    1.0        1.0    -0.6
High        1.0   1.0  1.0    1.0        1.0    -0.6
Low         1.0   1.0  1.0    1.0        1.0    -0.6
Close       1.0   1.0  1.0    1.0        1.0    -0.6
Adj Close   1.0   1.0  1.0    1.0        1.0    -0.6
Volume     -0.6  -0.6 -0.6   -0.6       -0.6     1.0

## `groupby()` method

In [106]:
## Load fake Company data in a Dataframe
data = pd.read_csv('./fake-company.csv')
data

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991   Dakota         HR   26   52000
4  1991     Elsa         RD   31   50000
5  1991    Frank      Admin   46   60000
6  1992    Grace      Admin   27   60000
7  1992  Hoffman         RD   32   52000
8  1992    Inaar      Admin   28   62000

#### Example 6: Demonstrate `groupby()`  `sum()` and `mean()` method

In [108]:
# We display the total amount of money spent in salaries each year
data.groupby(['Year'])['Salary'].sum()

Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

In [109]:
# We display the average salary per year
data.groupby(['Year'])['Salary'].mean()

Year
1990    51000.0
1991    54000.0
1992    58000.0
Name: Salary, dtype: float64

#### Example 7. Demonstrate `groupby()` on single and on two columns

In [110]:
# We display the total salary each employee received in all the years they worked for the company
data.groupby(['Name'])['Salary'].sum()

Name
Alice      50000
Bob        48000
Charlie    55000
Dakota     52000
Elsa       50000
Frank      60000
Grace      60000
Hoffman    52000
Inaar      62000
Name: Salary, dtype: int64

In [111]:
# We display the salary distribution per department per year.
data.groupby(['Year', 'Department'])['Salary'].sum()

Year  Department
1990  Admin          55000
      HR             50000
      RD             48000
1991  Admin          60000
      HR             52000
      RD             50000
1992  Admin         122000
      RD             52000
Name: Salary, dtype: int64